/*

    MAGIC.EXE
        ovr050
        ovr051
        ovr056
*/

#include "NEWGAME.H"

#include "MOX/Fonts.H"
#include "MOX/MOX_DEF.H"
#include "MOX/MOX_SET.H"
#include "MOX/MOX_TYPE.H"
#include "MOX/MOM_DATA.H"  /* _difficulty, _magic, _landsize, _num_players */
#include "MOX/Timer.H"

#include <stdio.h>      /* FILE; fclose(), fopen(), fread(), frite(), fseek(); */



/*

    MoO2
        Module: NEWGAME
            Newgame_Screen_
                Address: 01:000CD435
            Reload_Newgame_Screen_
                Address: 01:000CCA1C
            Draw_Newgame_Screen_
                Address: 01:000CCD3C
            Draw_Pictures_
                Address: 01:000CCC3D
            Add_Fields_
                Address: 01:000CCE2E
            Update_Fields_
                Address: 01:000CCE24
            data (0 bytes) _fields
                Address: 02:0019933C
            data (0 bytes) _background_seg
                Address: 02:00199354

        Module: MAPGEN
    
Reload_Newgame_Screen_
is where the loading happens
i.e., (Re-)Load

*/
/*

terrain_stats_table
770 records
6 bytes
half movement cost per movement type
0 unknwon
1 walking
2 Forster
3 Mountaineer
4 Swimming
5 Sailing
But, also, why 770? world_map terrain_type offset is 762 ?

*/

/*
Load_TERRSTAT()
terrain_stats_table = SA_MK_FP0( LBXR_LoadSingle("TERRSTAT", 0, 0, 770, 6) )

    XREF NEWG_SetMoveMaps+61  les     si, [terrain_stats_table]
    XREF NEWG_SetMoveMaps+94  les     si, [terrain_stats_table]
    XREF NEWG_SetMoveMaps+C4  les     si, [terrain_stats_table]
    XREF NEWG_SetMoveMaps+F7  les     si, [terrain_stats_table]
    XREF NEWG_SetMoveMaps+12A les     si, [terrain_stats_table]
    XREF NEWG_SetMoveMaps+15D les     si, [terrain_stats_table]
*/

/*
Load_SPELLDAT()
spell_data_table    = SA_MK_FP0( LBXR_LoadSingle("SPELLDAT", 0, 0, 215, 36) )

*/



struct S_HERO_TEMPLATE
{
    /* 00 */  int16_t pick_count;
    /* 02 */  int16_t pick_type;  // {warrior, mage, any/both/either} ; enum e_RANDOM_PICK_TYPES
    /* 04 */  int32_t abilities;
    /* 08 */  int16_t casting_skill;
    /* 0A */  int16_t spell_1;  // ; enum Spells
    /* 0C */  int16_t spell_2;  // ; enum Spells
    /* 0E */  int16_t spell_3;  // ; enum Spells
    /* 10 */  int16_t spell_4;  // ; enum Spells
    /* 12 */
};
enum e_RANDOM_PICK_TYPES
{
    Warrior_Picks  = 0,
    mage_picks     = 1,
    Any_Picks      = 2
};
struct S_HERO_TEMPLATE _hero_premade_table[NUM_HERO_TYPES] = {
    /* picks        special                  casting  spells     */
    /* count, type, abilities,               skill    1,  2,  3,  4 */
    /*  */  {      0,   0, HSA_CONSTITUTION,              0,  0,  0,  0,  0 },
    /*  */  {      0,   0, HSA_MIGHT,                     0,  0,  0, 0, 0 },
    /*  */  {      0,   1, HSA_SAGE,                      2,  42, 48, 0, 0 },
    /*  */  {      0,   0, HSA_NOBLE,                     0,  0, 0, 0, 0 },
    /*  */  {      0,   0, 0,                             1,  spl_Resist_Elements, 0, 0, 0 },
    /*  */  {      0,   0, (HSA_LEADERSHIP | HSA_FEMALE), 1, 46, 53, 0, 0 },
    /*  */  {      1,   0, 0,                             0, 0, 0, 0, 0 },
    /*  */  {      1,   1, 0x40000000, 2, 125, 0, 0, 0 },
