/*
    Unit View

    WIZARDS.EXE
        ovr072
        ovr078
        ovr089
*/
/*

USW_HeroAbilities is XREF'd by ovr102 Hero_Build_Specials_List

*/
/*
    HELP

in order, except 0x273  627
USW_HeroAbilities
0x0203  515
...
0x020E  526

USW_Abilities
0x018C  396
...
0x019A  410


USW_Attributes_1

*/

#include "MoM.H"
#include "UnitStat.H"
#include "UnitView.H"
#include <intrin.h>



// drake178: USW_Ability
// sizeof:  08h  8d
struct USW_Ability
{
    /* 00 */  char ** name;
    /* 02 */  int16_t bit_idx;  // enum ABL_FLAGS  ... tested against global_battle_unit->Abilities, which is copied from unit_type_table.Abilities
    /* 04 */  uint8_t icon_idx;  // 
    /* 05 */  // 2-byte alignment padding
    /* 06 */  int16_t help_idx;
    /* 08 */
};


// drake178: USW_Attribute_1
// sizeof:  08h  8d
struct USW_Attribute_1
{
    /* 00 */ char ** name;
    /* 02 */ int16_t bit_idx;  // enum ATTRIB_1
    /* 04 */ uint8_t icon_idx;
    /* 05 */  // 2-byte alignment padding
    /* 06 */ int16_t help_idx;
    /* 08 */
};


// drake178: USW_Attribute_2
// sizeof:  08h  8d
struct USW_Attribute_2
{
    /* 00 */ char ** name;
    /* 02 */ int16_t bit_idx;  // enum ATTRIB_2
    /* 04 */ uint8_t icon_idx;
    /* 05 */  // 2-byte alignment padding
    /* 06 */ int16_t help_idx;
    /* 08 */
};


// drake178: USW_AttackFlag
// sizeof:  08h  8d
struct USW_AttackFlag
{
    /* 00 */ char ** name;
    /* 02 */ int16_t bit_idx;  // enum ATK_FLAGS
    /* 04 */ uint8_t icon_idx;
    /* 05 */  // 2-byte alignment padding
    /* 06 */ int16_t help_idx;
    /* 08 */
};


// sizeof:  06h  6d
#pragma pack(push)
#pragma pack(2)
struct s_UNIT_MUTATION
{
    /* 00 */ char ** name;
    /* 02 */ int8_t flag;  // enum MUT_FLAGS
    /* 03 */ uint8_t icon_idx;
    /* 04 */ int16_t help_idx;
    /* 06 */
};
#pragma pack(pop)


// drake178: USW_SR_Attack
// sizeof:  06h  6d
struct USW_SR_Attack
{
    /* 00 */ char ** name;
    /* 02 */ int8_t Ranged_Type;  // enum Ranged_Type
    /* 03 */ uint8_t icon_idx;
    /* 04 */ int16_t help_idx;
    /* 06 */
};


// sizeof:  8h  8d
struct s_ITEM_VIEW_TEXT
{
/* 00 */ char * Name;
/* 02 */ char * Text;
/* 04 */ uint32_t Flags;  // ~== s_ITEM.Powers
/* 08 */
};





/*
¿ BEGIN:  ovr078  UV / USW ?
WZD dseg:3A50

USW_HeroAbilities
...
...
...
*/


// WZD dseg:4064
char cnst_LargeShield[] = "Large Shield";
char cnst_PlaneShift[] = "Plane Shift";
char cnst_WallCrusher[] = "Wall Crusher";
char cnst_Healer_2[] = "Healer";
char cnst_CreateOutpost[] = "Create Outpost";
char cnst_Invisibility[] = "Invisibility";
char cnst_CreateUndead[] = "Create Undead";
char cnst_Undead[] = "Undead";
char cnst_LongRange[] = "Long Range";
char cnst_LandCorruption[] = "Land Corruption";
char cnst_MeldWithNode[] = "Meld With Node";
char cnst_NonCorporeal[] = "Non Corporeal";
char cnst_WindWalking[] = "Wind Walking";
char cnst_Regeneration[] = "Regeneration";
char cnst_Purify[] = "Purify";
char cnst_Negate1stStrike[] = "Negate First Strike";

char cnst_Lucky[] = "Lucky";
char cnst_PoisonImmunity[] = "Poison Immunity";
char cnst_FireImmunity[] = "Fire Immunity";
char cnst_StoningImmunity[] = "Stoning Immunity";
char cnst_WeaponImmunity[] = "Weapon Immunity";
char cnst_MissileImmunity[] = "Missiles Immunity";
char cnst_IllusionsImm[] = "Illusions Immunity";
char cnst_ColdImmunity[] = "Cold Immunity";
char cnst_MagicImmunity[] = "Magic Immunity";
char cnst_DeathImmunity[] = "Death Immunity";

char cnst_HealingSpell[] = "Healing Spell";
char cnst_Spell_2[] = "Spell";
char cnst_FireBallSpell[] = "Fire Ball Spell";
char cnst_DoomboltSpell[] = "Doombolt Spell";
char cnst_Immolation[] = "Immolation";
char cnst_CauseFearSpell[] = "Cause Fear Spell";
char cnst_WebSpell[] = "Web Spell";
char cnst_ResistanceToAll[] = "Resistance To All";
char cnst_HolyBonus[] = "Holy Bonus";

char cnst_ArmorPiercing[] = "Armor Piercing";
char cnst_Poison[] = "Poison";
char cnst_LifeSteal[] = "Life Steal";
char cnst_AutomaticDmg[] = "Automatic Damage";
char cnst_Destruction[] = "Destruction";
char cnst_Illusion[] = "Illusion";
char cnst_StoningTouch[] = "Stoning Touch";
char cnst_DeathTouch[] = "Death Touch";
char cnst_PowerDrain[] = "Power Drain";
char cnst_DispelEvil[] = "Dispel Evil";



// WZD dseg:42A7
char cnst_ChaosChannel[] = "Chaos Channel";



// WZD dseg:42B5
char cnst_Thrown[] = "Thrown";
char cnst_FireBreath[] = "Fire Breath";
char cnst_Lightning[] = "Lightning";
char cnst_StoningGaze[] = "Stoning Gaze";
char cnst_DoomGaze[] = "Doom Gaze";
char cnst_DeathGaze[] = "Death Gaze";

// WZD dseg:4064 4C 61 72 67 65 20 53 68 69 65 6C 64             cnst_LargeShield db 'Large Shield'      ; DATA XREF: dseg:USW_Abilitieso



// WZD dseg:4070
/*
XREF'd by all three functions in ovr078
so, this is the boundary of the code module for the compiler's string optimizer/deduper
USW_Build_Effect_List:loc_679A8 mov     ax, offset cnst_ZeroString_18
Prod_Build_Specials_List+B      mov     ax, offset cnst_ZeroString_18
ITEM_GetPowerNames:loc_69DAA    mov     ax, offset cnst_ZeroString_18
*/
char empty_string_ovr078[] = "";

// WZD dseg:422C
// pilfered from cnst_HolyBonus
char cnst_Ammo_Plural[] = "s";





// WZD dseg:42F4
char cnst_GuardianWind[] = "Guardian Wind";
// WZD dseg:4302
char cnst_Berserk[] = "Berserk";
// WZD dseg:430A
char cnst_CloakOfFear[] = "Cloak Of Fear";
// WZD dseg:4318
char cnst_BlackChannels[] = "Black Channels";
// WZD dseg:4327
char cnst_WraithForm[] = "Wraith Form";
// WZD dseg:4333
char cnst_Regenerate[] = "Regenerate";
// WZD dseg:433E
char cnst_PathFinding[] = "Path Finding";
// WZD dseg:434B
char cnst_WaterWalking[] = "Water Walking";
// WZD dseg:4359
char cnst_ElementalArmor[] = "Elemental Armor";
// WZD dseg:4369
char cnst_ResistElements[] = "Resist Elements";
// WZD dseg:4379
char cnst_StoneSkin[] = "Stone Skin";
// WZD dseg:4384
char cnst_IronSkin[] = "Iron Skin";
// WZD dseg:438E
char cnst_Endurance[] = "Endurance";
// WZD dseg:4398
char cnst_SpellLock[] = "Spell Lock";
// WZD dseg:43A3
char cnst_Flight[] = "Flight";
// WZD dseg:43AA
char cnst_ResistMagic[] = "Resist Magic";
// WZD dseg:43B7
char cnst_FlameBlade[] = "Flame Blade";
// WZD dseg:43C3
char cnst_EldritchWeapon[] = "Eldritch Weapon";
// WZD dseg:43D3
char cnst_TrueSight[] = "True Sight";
// WZD dseg:43DE
char cnst_HolyWeapon[] = "Holy Weapon";
// WZD dseg:43EA
char cnst_Heroism[] = "Heroism";
// WZD dseg:43F2
char cnst_Bless[] = "Bless";
// WZD dseg:43F8
char cnst_LionHeart[] = "Lion Heart";
// WZD dseg:4403
char cnst_GiantStrength[] = "Giant Strength";
// WZD dseg:4412
char cnst_PlanarTravel[] = "Planar Travel";
// WZD dseg:4420
char cnst_HolyArmor[] = "Holy Armor";
// WZD dseg:442B
char cnst_Righteousness[] = "Righteousness";
// WZD dseg:4439
char cnst_Invulnerability[] = "Invulnerability";

// WZD dseg:4449
char cnst_Vertigo[] = "Vertigo";
// WZD dseg:4451
char cnst_Confusion[] = "Confusion";
// WZD dseg:445B
char cnst_Whirlwind[] = "Whirlwind";
// WZD dseg:4465
char cnst_MindStorm[] = "Mind Storm";
// WZD dseg:4470
char cnst_Shatter[] = "Shatter";
// WZD dseg:4478
char cnst_Weakness[] = "Weakness";
// WZD dseg:4481
char cnst_BlackSleep[] = "Black Sleep";
// WZD dseg:448D
char cnst_WarpCreature[] = "Warp Creature";
// WZD dseg:449B
char cnst_MindTwist[] = "Mind Twist";
// WZD dseg:44A6
char cnst_Haste[] = "Haste";
// WZD dseg:44AC
char cnst_Web[] = "Web";
// WZD dseg:44B0
char cnst_CreatureBinding[] = "Creature Binding";
// WZD dseg:44C1
char cnst_Possession[] = "Posession";
// WZD dseg:44CB
char cnst_Merging[] = "Merging";

// WZD dseg:44D3
char cnst_UnitLevel_1[] = "Recruit";
// WZD dseg:44DB
char cnst_UnitLevel_2[] = "Regular";
// WZD dseg:44E3
char cnst_UnitLevel_3[] = "Veteran";
// WZD dseg:44EB
char cnst_UnitLevel_4[] = "Elite";
// WZD dseg:44F1
char cnst_UnitLevel_5[] = "Ultra Elite";
// WZD dseg:44FD
char cnst_UnitLevel_6[] = "Champion";
// WZD dseg:4506
char cnst_HeroLevel_1[] = "Hero";
// WZD dseg:450B
char cnst_HeroLevel_2[] = "Myrmidon";
// WZD dseg:4514
char cnst_HeroLevel_3[] = "Captain";
// WZD dseg:451C
char cnst_HeroLevel_4[] = "Commander";
// WZD dseg:4526
char cnst_HeroLevel_6[] = "Lord";
// WZD dseg:452B
char cnst_HeroLevel_7[] = "Grand Lord";
// WZD dseg:4536
char cnst_HeroLevel_8[] = "Super Hero";
// WZD dseg:4541
char cnst_HeroLevel_9[] = "Demi-God";

// WZD dseg:454A
char cnst_Rank_I[] = "I";
// WZD dseg:454C
char cnst_Rank_II[] = "II";
// WZD dseg:454F
char cnst_Rank_III[] = "III";
// WZD dseg:4553
char cnst_Rank_IV[] = "IV";
// WZD dseg:4556
char cnst_SpaceOpenBrace2[] = " (";

// WZD dseg:4559
char cnst_ExperiencePts[] = " ep)";
// WZD dseg:455C
char cnst_ClosingBrace_3[] = ")";

// WZD dseg:455E
char cnst_Leadership[] = "Leadership";
// WZD dseg:4569
char cnst_SuperAbStar[] = "}";
// WZD dseg:456B
char cnst_Legendary[] = "Legendary";
// WZD dseg:4575
char cnst_Blademaster[] = "Blademaster";
// WZD dseg:4581
char cnst_Armsmaster[] = "Armsmaster";
// WZD dseg:458C
char cnst_Constitution[] = "Constitution";
// WZD dseg:4599
char cnst_Might[] = "Might";
// WZD dseg:459F
char cnst_ArcanePower[] = "Arcane Power";
// WZD dseg:45AC
char cnst_Sage_2[] = "Sage";

// WZD dseg:45B1
char cnst_Space_3[] = " ";

// WZD dseg:45B3
char cnst_ResearchPoints[] = " rp";
// WZD dseg:45B7
char cnst_Prayermaster[] = "Prayermaster";
// WZD dseg:45C4
char cnst_Agility[] = "Agility";
// WZD dseg:45CC
char cnst_Charmed[] = "Charmed";
// WZD dseg:45D4
char cnst_Noble[] = "Noble";

// WZD dseg:45DA
char cnst_SpacePlus[] = " +";

// WZD dseg:45DB
char cnst_Plus_1[] = "+";

// WZD dseg:45DD
char cnst_Caster[] = "Caster";
// WZD dseg:45E4
char cnst_Space_mp[] = " mp";
// WZD dseg:45E8
char cnst_Rock[] = "Rock";
// WZD dseg:45ED
char cnst_Arrow[] = "Arrow";
// WZD dseg:45F3
char cnst_Bullet[] = "Bullet";

// WZD dseg:45FA
char cnst_TimesSign[] = " x";

// WZD dseg:45FD
char cnst_ToHit[] = " To Hit";

// WZD dseg:4605
char cnst_Construction[] = "Construction";
// WZD dseg:4612
char cnst_Scouting[] = "Scouting";
// WZD dseg:461B
char cnst_Teleporting[] = "Teleporting";
// WZD dseg:4627
char cnst_Pathfinding[] = "Pathfinding";
// WZD dseg:4633
char cnst_Mountaineer[] = "Mountaineer";
// WZD dseg:463F
char cnst_Forester[] = "Forester";
// WZD dseg:4648
char cnst_SummonDemons[] = "Summon Demons";
// WZD dseg:4656
char cnst_Stasis[] = "Stasis";

// WZD dseg:465D
char cnst_Vampiric[] = "Vampiric";
// WZD dseg:4666
char cnst_VampiricText[] = ", life draining";
// WZD dseg:4676
char cnst_LightningText[] = ", armor piercing";
// WZD dseg:4687
char cnst_CloakofFear[] = "Cloak of Fear";
// WZD dseg:4695
char cnst_CoF_Text[] = ", as cloak of fear spell";
// WZD dseg:46AE
char cnst_DestructionText[] = ", resist or be disintegrated";
// WZD dseg:46CB
char cnst_Wraithform[] = "Wraithform";
// WZD dseg:46D6
char cnst_WraithformText[] = ", as wraithform spell";
// WZD dseg:46EC
char cnst_RegenerateText[] = ", as regeneration spell";
// WZD dseg:4704
char cnst_PF_Text[] = ", as pathfinding spell";
// WZD dseg:471B
char cnst_WaterWalkText[] = ", as water walking spell";
// WZD dseg:4734
char cnst_ResistElemText[] = ", as resist elements spell";
// WZD dseg:474F
char cnst_ElemArmorText[] = ", as elemental armor spell";
// WZD dseg:476A
char cnst_Doom[] = "Doom";
// WZD dseg:476F
char cnst_DoomText[] = ", ignores armor";
// WZD dseg:477F
char cnst_EnduranceText[] = ", as swiftness spell";  // ; BUG: there is no swiftness spell in the game
// WZD dseg:4794
char cnst_HasteText[] = ", doubles attacks";
// WZD dseg:47A6
char cnst_InvisText[] = ", as the invisibility spell";
// WZD dseg:47C2
char cnst_Death[] = "Death";
// WZD dseg:47C8
char cnst_DeathText[] = ", save at -3 or die";
// WZD dseg:47DC
char cnst_FlightText[] = ", as flight spell";
// WZD dseg:47EE
char cnst_ResMagicText[] = ", as resist magic spell";
// WZD dseg:4806
char cnst_MagicImmText[] = ", as magic immunity spell";
// WZD dseg:4820
char cnst_PDrainText[] = ", target loses 2-20 mana";
// WZD dseg:4839
char cnst_HolyAvenger[] = "Holy Avenger";
// WZD dseg:4846
char cnst_HolyAvengerText[] = ", as bless & dispel evil spell";
// WZD dseg:4865
char cnst_TrueSightText[] = ", as true sight spell";
// WZD dseg:487B
char cnst_Phantasmal[] = "Phantasmal";
// WZD dseg:4886
char cnst_PhantasmalText[] = ", ignores armor & illusion attacks";
// WZD dseg:48A9
char cnst_Flaming[] = "Flaming";
// WZD dseg:48B1
char cnst_FlamingText[] = ", +3 attack strength";
// WZD dseg:48C6
char cnst_BlessText[] = ", as bless spell";
// WZD dseg:48D7
char cnst_LionheartText[] = ", as lion heart spell";
// WZD dseg:48ED
char cnst_Stoning[] = "Stoning";
// WZD dseg:48F5
char cnst_StoningText[] = ", resist at -1 or be stoned";
// WZD dseg:4911
char cnst_PlanarTrvlText[] = ", as planar travel spell";
// WZD dseg:492A
char cnst_MergingText[] = ", as merging spell";  // ; BUG: there is no merging spell in the game
// WZD dseg:493D
char cnst_RightsnssText[] = ", as righteousness spell";
// WZD dseg:4956
char cnst_InvulnText[] = ", as invulnerability spell";
// WZD dseg:4971
char cnst_GWindText[] = ", as guardian wind spell";
// WZD dseg:498A
char cnst_GStrText[] = ", as giant strength spell";
// WZD dseg:49A4
char cnst_Space_ATK[] = " Attack";
// WZD dseg:49AC
char cnst_Space_DEF[] = " Defense";
// WZD dseg:49B5
char cnst_Space_Moves[] = " Movement";
// WZD dseg:49BF
char cnst_Space_RES[] = " Resistance";
// WZD dseg:49CB
char cnst_Space_Skill[] = " Spell Skill";
// WZD dseg:49D8
char cnst_MinusSign[] = "-";
// WZD dseg:49DA
char cnst_Space_SAVE[] = " Spell Save";

// WZD dseg:49DA                                                 ¿ END:  ovr078 - String (UV / USW) ?





// WZD dseg:3A50                                                 ¿ BEGIN:  ovr078  UV / USW ?

// WZD dseg:3A50
// drake178: struct USW_HeroAbl USW_HeroAbilities
struct USW_HeroAbl USW_HeroAbilities[23] =
{
/*    flags        pict  help               */
    { 0x00000001,   43,  HLP_LEADERSHIP   },
    { 0x00000002,   43,  HLP_LEADERSHIP   },
    { 0x00000008,   45,  HLP_LEGENDARY    },
    { 0x00000010,   45,  HLP_LEGENDARY    },
    { 0x00000040,   47,  HLP_BLADEMASTER  },
    { 0x00000080,   47,  HLP_BLADEMASTER  },
    { 0x00000200,   46,  HLP_ARMSMASTER   },
    { 0x00000400,   46,  HLP_ARMSMASTER   },
    { 0x00001000,   50,  HLP_CONSTITUTION },
    { 0x00002000,   50,  HLP_CONSTITUTION },
    { 0x00008000,   52,  HLP_MIGHT        },
    { 0x00010000,   52,  HLP_MIGHT        },
    { 0x00040000,   54,  HLP_ARCANE_POWER },
    { 0x00080000,   54,  HLP_ARCANE_POWER },
    { 0x00200000,   61,  HLP_SAGE         },
    { 0x00400000,   61,  HLP_SAGE         },
    { 0x01000000,   57,  HLP_PRAYERMASTER },
    { 0x02000000,   57,  HLP_PRAYERMASTER },
    { 0x80000000,  143,  HLP_AGILE        },  /* out of order */
    { 0x04000000,  143,  HLP_AGILE        },  /* out of order */
    { 0x08000000,   58,  HLP_LUCKY_HERO   },
    { 0x10000000,   59,  HLP_CHARMED      },
    { 0x20000000,   60,  HLP_NOBLE        }
};

char * unit_ability_names[15] =
{
    cnst_LargeShield,
    cnst_PlaneShift,
    cnst_WallCrusher,
    cnst_Healer_2,
    cnst_CreateOutpost,
    cnst_Invisibility,
    cnst_CreateUndead,
    cnst_LongRange,
    cnst_LandCorruption,
    cnst_MeldWithNode,
    cnst_NonCorporeal,
    cnst_WindWalking,
    cnst_Regeneration,
    cnst_Purify,
    cnst_Negate1stStrike
};


// WZD dseg:3B08
// drake178: struct USW_Ability USW_Abilities
struct USW_Ability USW_Abilities[15] =
{
/*   name                      flags    pict  help    */
    {&unit_ability_names[ 0],  0x0002,   14,  396},
    {&unit_ability_names[ 1],  0x0004,    4,  0x018D},
    {&unit_ability_names[ 2],  0x0008,   15,  0x018E},
    {&unit_ability_names[ 3],  0x0010,   16,  0x018F},
    {&unit_ability_names[ 4],  0x0020,   17,  0x0190},
    {&unit_ability_names[ 5],  0x0040,   18,  0x0191},
    {&unit_ability_names[ 6],  0x0080,   19,  0x0192},
    {&unit_ability_names[ 7],  0x0100,  129,  0x0193},
    {&unit_ability_names[ 8],  0x0200,   21,  0x0194},
    {&unit_ability_names[ 9],  0x0400,   40,  0x0195},
    {&unit_ability_names[10],  0x0800,   22,  0x0196},
    {&unit_ability_names[11],  0x1000,   23,  0x0197},
    {&unit_ability_names[12],  0x2000,   24,  0x0198},
    {&unit_ability_names[13],  0x4000,   25,  0x0199},
    {&unit_ability_names[14],  0x8000,   48,  0x019A}
};



char * unit_attribute_1_names[10] =
{
    cnst_Lucky,
    cnst_PoisonImmunity,
    cnst_FireImmunity,
    cnst_StoningImmunity,
    cnst_WeaponImmunity,
    cnst_MissileImmunity,
    cnst_IllusionsImm,
    cnst_ColdImmunity,
    cnst_MagicImmunity,
    cnst_DeathImmunity
};

// WZD dseg:3B80
// drake178: struct USW_Attribute_1 USW_Attributes_1
struct USW_Attribute_1 USW_Attributes_1[10] =
{
    { &unit_attribute_1_names[0],  0x0400,  0x007F,  0x019B },
    { &unit_attribute_1_names[1],  0x0080,  0x0005,  0x019C },
    { &unit_attribute_1_names[2],  0x0001,  0x0006,  0x019D },
    { &unit_attribute_1_names[3],  0x0002,  0x0007,  0x019E },
    { &unit_attribute_1_names[4],  0x0100,  0x0008,  0x019F },
    { &unit_attribute_1_names[5],  0x0004,  0x0009,  0x01A0 },
    { &unit_attribute_1_names[6],  0x0008,  0x000A,  0x01A1 },
    { &unit_attribute_1_names[7],  0x0010,  0x000B,  0x01A2 },
    { &unit_attribute_1_names[8],  0x0020,  0x000C,  0x01A3 },
    { &unit_attribute_1_names[9],  0x0040,  0x0031,  0x01A4 }
};

char * unit_attribute_2_names[8] =
{
    cnst_HealingSpell,
    cnst_FireBallSpell,
    cnst_DoomboltSpell,
    cnst_Immolation,
    cnst_CauseFearSpell,
    cnst_WebSpell,
    cnst_ResistanceToAll,
    cnst_HolyBonus
};

// WZD dseg:3BD0
struct USW_Attribute_2 USW_Attributes_2[8] =
{
    { &unit_attribute_2_names[0],  0x0001,  0x0026,  0x01A5 },
    { &unit_attribute_2_names[1],  0x0002,  0x0027,  0x01A6 },
    { &unit_attribute_2_names[2],  0x0004,  0x0029,  0x01A7 },
    { &unit_attribute_2_names[3],  0x0008,  0x0020,  0x01A8 },
    { &unit_attribute_2_names[4],  0x0020,  0x0084,  0x01A9 },
    { &unit_attribute_2_names[5],  0x0010,  0x0083,  0x01AA },
    { &unit_attribute_2_names[6],  0x0040,  0x0021,  0x01AB },
    { &unit_attribute_2_names[7],  0x0080,  0x0022,  0x01AC },
};



/*
    Strings by Address (offset)
        WZD dseg:4064
        WZD dseg:49DA
*/

char * unit_attack_flag_names[11] =
{
    cnst_ArmorPiercing,
    cnst_Poison,
    cnst_LifeSteal,
    cnst_AutomaticDmg,
    cnst_Destruction,
    cnst_Illusion,
    cnst_StoningTouch,
    cnst_DeathTouch,
    cnst_PowerDrain,
    cnst_DispelEvil
};

// WZD dseg:3C10
struct USW_AttackFlag USW_ATK_Flags[11] = 
{
    { &unit_attack_flag_names[ 0],  0x0001,  0x001C,  0x01AD },
    { &unit_attack_flag_names[ 1],  0x0002,  0x001D,  0x01AE },
    { &unit_attack_flag_names[ 2],  0x0004,  0x001E,  0x01AF },
    { &unit_attack_flag_names[ 3],  0x0008,  0x001F,  0x01B0 },
    { &unit_attack_flag_names[ 4],  0x0010,  0x008C,  0x01B1 },
    { &unit_attack_flag_names[ 5],  0x0020,  0x0074,  0x01B2 },
    { &unit_attack_flag_names[ 6],  0x0040,  0x0023,  0x01B3 },
    { &unit_attack_flag_names[ 7],  0x0080,  0x001B,  0x01B4 },
    { &unit_attack_flag_names[ 8],  0x0200,  0x008D,  0x01B5 },
    { &unit_attack_flag_names[ 9],  0x0400,  0x008E,  0x01B6 },
    { &unit_attack_flag_names[10],  0x0800,  0x0085,  0x01B7 }
};



char * unit_mutation_names[] =
{
    cnst_ChaosChannel
};

// WZD dseg:3C68
// { name, flag, icon_idx, help_idx }
struct s_UNIT_MUTATION _unit_mutation_data[3] =
{
    { &unit_mutation_names[0],  0x04,  SPECIAL_ICON_WARPED_DEFENSE,  HLP_WARPED_DEFENSE },
    { &unit_mutation_names[0],  0x08,  SPECIAL_ICON_WARPED_FLIGHT,   HLP_WARPED_FLIGHT  },
    { &unit_mutation_names[0],  0x10,  SPECIAL_ICON_WARPED_BREATH,   HLP_WARPED_BREATH  }
};


char * unit_sr_attack_names[] =
{
    cnst_Thrown,
    cnst_FireBreath,
    cnst_Lightning,
    cnst_StoningGaze,
    cnst_DoomGaze,
    cnst_DeathGaze
};

// WZD dseg:3C7A
struct USW_SR_Attack USW_SR_Attacks[] =
{
    { &unit_sr_attack_names[0], srat_Thrown,      SPECIAL_ICON_THROWN,            HLP_THROWN           },
    { &unit_sr_attack_names[1], srat_FireBreath,  SPECIAL_ICON_FIRE_BREATH,       HLP_FIRE_BREATH      },
    { &unit_sr_attack_names[2], srat_Lightning,   SPECIAL_ICON_LIGHTNING_BREATH,  HLP_LIGHTNING_BREATH },
    { &unit_sr_attack_names[3], srat_StoneGaze,   SPECIAL_ICON_STONING_GAZE,      HLP_STONING_GAZE     },
    { &unit_sr_attack_names[4], srat_MultiGaze,   SPECIAL_ICON_DOOM_GAZE,         HLP_DOOM_GAZE        },
    { &unit_sr_attack_names[5], srat_DeathGaze,   SPECIAL_ICON_DEATH_GAZE,        HLP_DEATH_GAZE       }
};



// WZD dseg:3C9E
// _unit_enchantment_data
// sizeof:  0Ah  10d
#pragma pack(push)
#pragma pack(2)
struct s_UNIT_ENCHANTMENT
{
/* 00 */ char ** name;
/* 02 */ uint32_t flag;  // ¿ enum e_UNIT_ENCHANTMENT ?
/* 06 */ uint8_t icon_idx;
/* 07 */ uint8_t align2_07h;  // 2-byte alignment
/* 08 */ int16_t help_idx;    // ; enum HELP_TXT
/* 0A */
};
#pragma pack(pop)

char * unit_enchantment_names[NUM_UNIT_ENCHANTMENTS] =
{
    cnst_Immolation,
    cnst_GuardianWind,
    cnst_Berserk,
    cnst_CloakOfFear,
    cnst_BlackChannels,
    cnst_WraithForm,
    cnst_Regenerate,
    cnst_PathFinding,
    cnst_WaterWalking,
    cnst_ElementalArmor,
    cnst_ResistElements,
    cnst_StoneSkin,
    cnst_IronSkin,
    cnst_Endurance,
    cnst_SpellLock,
    cnst_Invisibility,
    cnst_WindWalking,
    cnst_Flight,
    cnst_ResistMagic,
    cnst_MagicImmunity,
    cnst_FlameBlade,
    cnst_EldritchWeapon,
    cnst_TrueSight,
    cnst_HolyWeapon,
    cnst_Heroism,
    cnst_Bless,
    cnst_LionHeart,
    cnst_GiantStrength,
    cnst_PlanarTravel,
    cnst_HolyArmor,
    cnst_Righteousness,
    cnst_Invulnerability
};

struct s_UNIT_ENCHANTMENT _unit_enchantment_data[NUM_UNIT_ENCHANTMENTS] =
{
{ &unit_enchantment_names[ 0],  0x00000001,  0x75,  HLP_IMMOLATION_UE      },
{ &unit_enchantment_names[ 1],  0x00000002,  0x76,  HLP_GUARDIAN_WIND      },
{ &unit_enchantment_names[ 2],  0x00000004,  0x80,  HLP_BERSERK            },
{ &unit_enchantment_names[ 3],  0x00000008,  0x61,  HLP_CLOAK_OF_FEAR      },
{ &unit_enchantment_names[ 4],  0x00000010,  0x43,  HLP_BLACK_CHANNELS     },
{ &unit_enchantment_names[ 5],  0x00000020,  0x44,  HLP_WRAITH_FORM        },
{ &unit_enchantment_names[ 6],  0x00000040,  0x45,  HLP_REGENERATE         },
{ &unit_enchantment_names[ 7],  0x00000080,  0x46,  HLP_PATHFINDING_UE     },
{ &unit_enchantment_names[ 8],  0x00000100,  0x47,  HLP_WATER_WALKING      },
{ &unit_enchantment_names[ 9],  0x00000400,  0x49,  HLP_ELEMENTAL_ARMOR    },
{ &unit_enchantment_names[10],  0x00000200,  0x48,  HLP_RESIST_ELEMENTS    },
{ &unit_enchantment_names[11],  0x00000800,  0x4A,  HLP_STONE_SKIN         },
{ &unit_enchantment_names[12],  0x00001000,  0x4B,  HLP_IRON_SKIN          },
{ &unit_enchantment_names[13],  0x00002000,  0x4C,  HLP_ENDURANCE          },
{ &unit_enchantment_names[14],  0x00004000,  0x77,  HLP_SPELL_LOCK         },
{ &unit_enchantment_names[15],  0x00008000,  0x4E,  HLP_INVISIBILITY_UE    },
{ &unit_enchantment_names[16],  0x00010000,  0x4F,  HLP_WIND_WALKING_UE    },
{ &unit_enchantment_names[17],  0x00020000,  0x50,  HLP_FLIGHT             },
{ &unit_enchantment_names[18],  0x00040000,  0x51,  HLP_RESIST_MAGIC       },
{ &unit_enchantment_names[19],  0x00080000,  0x52,  HLP_MAGIC_IMMUNITY_UE  },
{ &unit_enchantment_names[20],  0x00100000,  0x53,  HLP_FLAME_BLADE        },
{ &unit_enchantment_names[21],  0x00200000,  0x54,  HLP_ELDRITCH_WEAPON    },
{ &unit_enchantment_names[22],  0x00400000,  0x55,  HLP_TRUE_SIGHT         },
{ &unit_enchantment_names[23],  0x00800000,  0x56,  HLP_HOLY_WEAPON        },
{ &unit_enchantment_names[24],  0x01000000,  0x57,  HLP_HEROISM            },
{ &unit_enchantment_names[25],  0x02000000,  0x58,  HLP_BLESS              },
{ &unit_enchantment_names[26],  0x04000000,  0x59,  HLP_LION_HEART         },
{ &unit_enchantment_names[27],  0x08000000,  0x41,  HLP_GIANT_STRENGTH     },
{ &unit_enchantment_names[28],  0x10000000,  0x5B,  HLP_PLANAR_TRAVEL_UE   },
{ &unit_enchantment_names[29],  0x20000000,  0x5C,  HLP_HOLY_ARMOR         },
{ &unit_enchantment_names[30],  0x40000000,  0x5D,  HLP_RIGHTEOUSNESS      },
{ &unit_enchantment_names[31],  0x80000000,  0x5E,  HLP_INVULNERABILITY    }
};

/*
_unit_enchantment_data

EB 41 01 00 00 00 75 00 C1 01 F4 42 02 00 00 00
76 00 C2 01 02 43 04 00 00 00 80 00 C3 01 0A 43
08 00 00 00 61 00 C4 01 18 43 10 00 00 00 43 00
C5 01 27 43 20 00 00 00 44 00 C6 01 33 43 40 00
00 00 45 00 C7 01 3E 43 80 00 00 00 46 00 C8 01
4B 43 00 01 00 00 47 00 C9 01 59 43 00 04 00 00
49 00 CA 01 69 43 00 02 00 00 48 00 CB 01 79 43
00 08 00 00 4A 00 CC 01 84 43 00 10 00 00 4B 00
CD 01 8E 43 00 20 00 00 4C 00 CE 01 98 43 00 40
00 00 77 00 CF 01 A0 40 00 80 00 00 4E 00 D0 01
F3 40 00 00 01 00 4F 00 D1 01 A3 43 00 00 02 00
50 00 D2 01 AA 43 00 00 04 00 51 00 D3 01 A0 41
00 00 08 00 52 00 D4 01 B7 43 00 00 10 00 53 00
D5 01 C3 43 00 00 20 00 54 00 D6 01 D3 43 00 00
40 00 55 00 D7 01 DE 43 00 00 80 00 56 00 D8 01
EA 43 00 00 00 01 57 00 D9 01 F2 43 00 00 00 02
58 00 DA 01 F8 43 00 00 00 04 59 00 DB 01 03 44
00 00 00 08 41 00 DC 01 12 44 00 00 00 10 5B 00
DD 01 20 44 00 00 00 20 5C 00 DE 01 2B 44 00 00
00 40 5D 00 DF 01 39 44 00 00 00 80 5E 00 E0 01


s_UNIT_ENCHANTMENT <offset cnst_Immolation, 1, 75h, 0, HLP_IMMOLATION_UE>
s_UNIT_ENCHANTMENT <offset cnst_GuardianWind, 2, 76h, 0, HLP_GUARDIAN_WIND>
s_UNIT_ENCHANTMENT <offset cnst_Berserk, 4, 80h, 0, HLP_BERSERK>
s_UNIT_ENCHANTMENT <offset cnst_CloakOfFear, 8, 61h, 0, HLP_CLOAK_OF_FEAR>
s_UNIT_ENCHANTMENT <offset cnst_BlackChannels, 10h, 43h, 0, HLP_BLACK_CHANNELS>
s_UNIT_ENCHANTMENT <offset cnst_WraithForm, 20h, 44h, 0, HLP_WRAITH_FORM>
s_UNIT_ENCHANTMENT <offset cnst_Regenerate, 40h, 45h, 0, HLP_REGENERATE>
s_UNIT_ENCHANTMENT <offset cnst_PathFinding, 80h, 46h, 0, HLP_PATHFINDING_UE>
s_UNIT_ENCHANTMENT <offset cnst_WaterWalking, 100h, 47h, 0, HLP_WATER_WALKING>
s_UNIT_ENCHANTMENT <offset cnst_ElementalArmor, 400h, 49h, 0, HLP_ELEMENTAL_ARMOR>
s_UNIT_ENCHANTMENT <offset cnst_ResistElements, 200h, 48h, 0, HLP_RESIST_ELEMENTS>
s_UNIT_ENCHANTMENT <offset cnst_StoneSkin, 800h, 4Ah, 0, HLP_STONE_SKIN>
s_UNIT_ENCHANTMENT <offset cnst_IronSkin, 1000h, 4Bh, 0, HLP_IRON_SKIN>
s_UNIT_ENCHANTMENT <offset cnst_Endurance, 2000h, 4Ch, 0, HLP_ENDURANCE>
s_UNIT_ENCHANTMENT <offset cnst_SpellLock, 4000h, 77h, 0, HLP_SPELL_LOCK>
s_UNIT_ENCHANTMENT <offset cnst_Invisibility, 8000h, 4Eh, 0, HLP_INVISIBILITY_UE>
s_UNIT_ENCHANTMENT <offset cnst_WindWalking, 10000h, 4Fh, 0, HLP_WIND_WALKING_UE>
s_UNIT_ENCHANTMENT <offset cnst_Flight, 20000h, 50h, 0, HLP_FLIGHT>
s_UNIT_ENCHANTMENT <offset cnst_ResistMagic, 40000h, 51h, 0, HLP_RESIST_MAGIC>
s_UNIT_ENCHANTMENT <offset cnst_MagicImmunity, 80000h, 52h, 0, HLP_MAGIC_IMMUNITY_UE>
s_UNIT_ENCHANTMENT <offset cnst_FlameBlade, 100000h, 53h, 0, HLP_FLAME_BLADE>
s_UNIT_ENCHANTMENT <offset cnst_EldritchWeapon, 200000h, 54h, 0, HLP_ELDRITCH_WEAPON>
s_UNIT_ENCHANTMENT <offset cnst_TrueSight, 400000h, 55h, 0, HLP_TRUE_SIGHT>
s_UNIT_ENCHANTMENT <offset cnst_HolyWeapon, 800000h, 56h, 0, HLP_HOLY_WEAPON>
s_UNIT_ENCHANTMENT <offset cnst_Heroism, 1000000h, 57h, 0, HLP_HEROISM>
s_UNIT_ENCHANTMENT <offset cnst_Bless, 2000000h, 58h, 0, HLP_BLESS>
s_UNIT_ENCHANTMENT <offset cnst_LionHeart, 4000000h, 59h, 0, HLP_LION_HEART>
s_UNIT_ENCHANTMENT <offset cnst_GiantStrength, 8000000h, 41h, 0, HLP_GIANT_STRENGTH>
s_UNIT_ENCHANTMENT <offset cnst_PlanarTravel, 10000000h, 5Bh, 0, HLP_PLANAR_TRAVEL_UE>
s_UNIT_ENCHANTMENT <offset cnst_HolyArmor, 20000000h, 5Ch, 0, HLP_HOLY_ARMOR>
s_UNIT_ENCHANTMENT <offset cnst_Righteousness, 40000000h, 5Dh, 0, HLP_RIGHTEOUSNESS>
s_UNIT_ENCHANTMENT <offset cnst_Invulnerability, 80000000h, 5Eh, 0, HLP_INVULNERABILITY>

{ cnst_Immolation,       0x00000001,  0x75,  HLP_IMMOLATION_UE      },
{ cnst_GuardianWind,     0x00000002,  0x76,  HLP_GUARDIAN_WIND      },
{ cnst_Berserk,          0x00000004,  0x80,  HLP_BERSERK            },
{ cnst_CloakOfFear,      0x00000008,  0x61,  HLP_CLOAK_OF_FEAR      },
{ cnst_BlackChannels,    0x00000010,  0x43,  HLP_BLACK_CHANNELS     },
{ cnst_WraithForm,       0x00000020,  0x44,  HLP_WRAITH_FORM        },
{ cnst_Regenerate,       0x00000040,  0x45,  HLP_REGENERATE         },
{ cnst_PathFinding,      0x00000080,  0x46,  HLP_PATHFINDING_UE     },
{ cnst_WaterWalking,     0x00000100,  0x47,  HLP_WATER_WALKING      },
{ cnst_ElementalArmor,   0x00000400,  0x49,  HLP_ELEMENTAL_ARMOR    },
{ cnst_ResistElements,   0x00000200,  0x48,  HLP_RESIST_ELEMENTS    },
{ cnst_StoneSkin,        0x00000800,  0x4A,  HLP_STONE_SKIN         },
{ cnst_IronSkin,         0x00001000,  0x4B,  HLP_IRON_SKIN          },
{ cnst_Endurance,        0x00002000,  0x4C,  HLP_ENDURANCE          },
{ cnst_SpellLock,        0x00004000,  0x77,  HLP_SPELL_LOCK         },
{ cnst_Invisibility,     0x00008000,  0x4E,  HLP_INVISIBILITY_UE    },
{ cnst_WindWalking,      0x00010000,  0x4F,  HLP_WIND_WALKING_UE    },
{ cnst_Flight,           0x00020000,  0x50,  HLP_FLIGHT             },
{ cnst_ResistMagic,      0x00040000,  0x51,  HLP_RESIST_MAGIC       },
{ cnst_MagicImmunity,    0x00080000,  0x52,  HLP_MAGIC_IMMUNITY_UE  },
{ cnst_FlameBlade,       0x00100000,  0x53,  HLP_FLAME_BLADE        },
{ cnst_EldritchWeapon,   0x00200000,  0x54,  HLP_ELDRITCH_WEAPON    },
{ cnst_TrueSight,        0x00400000,  0x55,  HLP_TRUE_SIGHT         },
{ cnst_HolyWeapon,       0x00800000,  0x56,  HLP_HOLY_WEAPON        },
{ cnst_Heroism,          0x01000000,  0x57,  HLP_HEROISM            },
{ cnst_Bless,            0x02000000,  0x58,  HLP_BLESS              },
{ cnst_LionHeart,        0x04000000,  0x59,  HLP_LION_HEART         },
{ cnst_GiantStrength,    0x08000000,  0x41,  HLP_GIANT_STRENGTH     },
{ cnst_PlanarTravel,     0x10000000,  0x5B,  HLP_PLANAR_TRAVEL_UE   },
{ cnst_HolyArmor,        0x20000000,  0x5C,  HLP_HOLY_ARMOR         },
{ cnst_Righteousness,    0x40000000,  0x5D,  HLP_RIGHTEOUSNESS      },
{ cnst_Invulnerability,  0x80000000,  0x5E,  HLP_INVULNERABILITY    },


*/


// WZD dseg:3DDE
// drake178: USW_Combat_FX USW_CombatEffect
// sizeof:  0Ah  10d
struct USW_CombatEffect
{
    /* 00 */ char ** name;
    /* 02 */ uint32_t CEff_Flags;
    /* 06 */ uint8_t icon_idx;
    /* 07 */ // 2-byte alignment
    /* 08 */ int16_t help_idx;  // enum HELP_TXT
    /* 0A */
};

char * battle_unit_combat_effect_names[15] =
{
    cnst_Vertigo,
    cnst_Confusion,
    cnst_Whirlwind,
    cnst_MindStorm,
    cnst_Shatter,
    cnst_Weakness,
    cnst_BlackSleep,
    cnst_WarpCreature,
    cnst_WarpCreature,
    cnst_WarpCreature,
    cnst_MindTwist,
    cnst_Haste,
    cnst_Web,
    cnst_CreatureBinding,
    cnst_Possession
};

struct USW_CombatEffect USW_Combat_FX[15] =
{
{ &battle_unit_combat_effect_names[ 0],  0x0001,  0x65,  HLP_VERTIGO            },
{ &battle_unit_combat_effect_names[ 1],  0x0002,  0x6F,  HLP_CONFUSION          },
{ &battle_unit_combat_effect_names[ 2],  0x0004,  0x70,  HLP_WHIRLWIND          },
{ &battle_unit_combat_effect_names[ 3],  0x0008,  0x71,  HLP_MIND_STORM         },
{ &battle_unit_combat_effect_names[ 4],  0x0010,  0x5F,  HLP_SHATTER            },
{ &battle_unit_combat_effect_names[ 5],  0x0020,  0x60,  HLP_WEAKNESS           },
{ &battle_unit_combat_effect_names[ 6],  0x0040,  0x72,  HLP_BLACK_SLEEP        },
{ &battle_unit_combat_effect_names[ 7],  0x0080,  0x7A,  HLP_WARP_CREATURE_Atk  },
{ &battle_unit_combat_effect_names[ 8],  0x0100,  0x7B,  HLP_WARP_CREATURE_Def  },
{ &battle_unit_combat_effect_names[ 9],  0x0200,  0x7C,  HLP_WARP_CREATURE_Res  },
{ &battle_unit_combat_effect_names[10],  0x0400,  0x79,  HLP_MANA_LEAK          },
{ &battle_unit_combat_effect_names[11],  0x0800,  0x4D,  HLP_HASTE              },
{ &battle_unit_combat_effect_names[12],  0x1000,  0x63,  HLP_WEB                },
{ &battle_unit_combat_effect_names[13],  0x2000,  0x64,  HLP_CREATURE_BINDING   },
{ &battle_unit_combat_effect_names[14],  0x4000,  0x62,  HLP_POSSESSION         },
};
/*
USW_Combat_FX

49 44 01 00 00 00 65 00 E1 01 
51 44 02 00 00 00 6F 00 E2 01 
5B 44 04 00 00 00 70 00 E3 01 
65 44 08 00 00 00 71 00 E4 01 
70 44 10 00 00 00 5F 00 E5 01 
78 44 20 00 00 00 60 00 E6 01 
81 44 40 00 00 00 72 00 E7 01 
8D 44 80 00 00 00 7A 00 E8 01 
8D 44 00 01 00 00 7B 00 E9 01 
8D 44 00 02 00 00 7C 00 EA 01 
9B 44 00 04 00 00 79 00 EB 01 
A6 44 00 08 00 00 4D 00 EC 01 
AC 44 00 10 00 00 63 00 ED 01 
B0 44 00 20 00 00 64 00 EE 01 
C1 44 00 40 00 00 62 00 EF 01                              

USW_CombatEffect <offset cnst_Vertigo, 1, 65h, 0, HLP_VERTIGO>
USW_CombatEffect <offset cnst_Confusion, 2, 6Fh, 0, HLP_CONFUSION> ; "Vertigo"
USW_CombatEffect <offset cnst_Whirlwind, 4, 70h, 0, HLP_WHIRLWIND>
USW_CombatEffect <offset cnst_MindStorm, 8, 71h, 0, HLP_MIND_STORM>
USW_CombatEffect <offset cnst_Shatter, 10h, 5Fh, 0, HLP_SHATTER>
USW_CombatEffect <offset cnst_Weakness, 20h, 60h, 0, HLP_WEAKNESS>
USW_CombatEffect <offset cnst_BlackSleep, 40h, 72h, 0, HLP_BLACK_SLEEP>
USW_CombatEffect <offset cnst_WarpCreature, 80h, 7Ah, 0, HLP_WARP_CREATURE_Atk>
USW_CombatEffect <offset cnst_WarpCreature, 100h, 7Bh, 0, HLP_WARP_CREATURE_Def>
USW_CombatEffect <offset cnst_WarpCreature, 200h, 7Ch, 0, HLP_WARP_CREATURE_Res>
USW_CombatEffect <offset cnst_MindTwist, 400h, 79h, 0, HLP_MANA_LEAK>
USW_CombatEffect <offset cnst_Haste, 800h, 4Dh, 0, HLP_HASTE>
USW_CombatEffect <offset cnst_Web, 1000h, 63h, 0, HLP_WEB>
USW_CombatEffect <offset cnst_CreatureBinding, 2000h, 64h, 0, HLP_CREATURE_BINDING>
USW_CombatEffect <offset cnst_Possession, 4000h, 62h, 0, HLP_POSSESSION>

{ cnst_Vertigo,          0x0001,  65h,  HLP_VERTIGO            },
{ cnst_Confusion,        0x0002,  6Fh,  HLP_CONFUSION          },
{ cnst_Whirlwind,        0x0004,  70h,  HLP_WHIRLWIND          },
{ cnst_MindStorm,        0x0008,  71h,  HLP_MIND_STORM         },
{ cnst_Shatter,          0x0010,  5Fh,  HLP_SHATTER            },
{ cnst_Weakness,         0x0020,  60h,  HLP_WEAKNESS           },
{ cnst_BlackSleep,       0x0040,  72h,  HLP_BLACK_SLEEP        },
{ cnst_WarpCreature,     0x0080,  7Ah,  HLP_WARP_CREATURE_Atk  },
{ cnst_WarpCreature,     0x0100,  7Bh,  HLP_WARP_CREATURE_Def  },
{ cnst_WarpCreature,     0x0200,  7Ch,  HLP_WARP_CREATURE_Res  },
{ cnst_MindTwist,        0x0400,  79h,  HLP_MANA_LEAK          },
{ cnst_Haste,            0x0800,  4Dh,  HLP_HASTE              },
{ cnst_Web,              0x1000,  63h,  HLP_WEB                },
{ cnst_CreatureBinding,  0x2000,  64h,  HLP_CREATURE_BINDING   },
{ cnst_Possession,       0x4000,  62h,  HLP_POSSESSION         },

*/

// sizeof: 0Ah  10d
struct USW_ItemPower
{
/* 00 */  char * name;
/* 02 */  uint32_t bit_idx;
/* 06 */ SAMB_INT icon_idx;  // index into specials, starting at 102
/* 08 */ int16_t help_idx;  //  enum HELP_TXT
/* 0A */
};


// WZD dseg:3E74
// USW_Item_UEs
struct USW_ItemPower USW_Item_UEs[21] =
{
{ cnst_MagicImmunity,    0x80000000,   0,  HLP_MAGIC_IMMUNITY_I },
{ cnst_Regenerate,       0x00000040,   1,  HLP_REGENERATE_I },
{ cnst_Haste,            0x00004000,   2,  HLP_HASTE_I },
{ cnst_TrueSight,        0x00400000,   3,  HLP_TRUE_SIGHT_I },
{ cnst_PathFinding,      0x00000080,   4,  HLP_PATH_FINDING },
{ cnst_WaterWalking,     0x00000100,   5,  HLP_WATER_WALKING_I },
{ cnst_Bless,            0x02000000,   6,  HLP_BLESS_I },
{ cnst_LionHeart,        0x04000000,   7,  HLP_LION_HEART_I },
{ cnst_Invisibility,     0x00008000,   8,  HLP_INVISIBILITY_I },
{ cnst_PlanarTravel,     0x10000000,   9,  HLP_PLANAR_TRAVEL_I },
{ cnst_Endurance,        0x00002000,  10,  HLP_ENDURANCE_I },
{ cnst_Righteousness,    0x40000000,  11,  HLP_RIGHTEOUSNESS_I },
{ cnst_Invulnerability,  0x80000000,  12,  HLP_INVULNERABILITY_I },
