#ifndef UNITTYPE_H
#define UNITTYPE_H

#include "MoM.H"



enum e_UNIT_TYPE
{
    ut_Dwarf  = 0,
    ut_Barbarian  = 1,
    ut_Sage  = 2,
    ut_Dervish  = 3,
    ut_Beastmaster  = 4,
    ut_Bard  = 5,
    ut_OrcWarrior  = 6,
    ut_Healer  = 7,
    ut_Huntress  = 8,
    ut_Thief  = 9,
    ut_Druid  = 10,
    ut_War_Monk  = 11,
    ut_WarriorMage  = 12,
    ut_Magician  = 13,
    ut_Assassin  = 14,
    ut_WindMage  = 15,
    ut_Ranger  = 16,
    ut_Draconian  = 17,
    ut_Witch  = 18,
    ut_GoldenOne  = 19,
    ut_Ninja  = 20,
    ut_Rogue  = 21,
    ut_Amazon  = 22,
    ut_Warlock  = 23,
    ut_Unknown  = 24,
    ut_Illusionist  = 25,
    ut_Swordsman  = 26,
    ut_Priestess  = 27,
    ut_Paladin  = 28,
    ut_BlackKnight  = 29,
    ut_ElvenArcher  = 30,
    ut_Knight  = 31,
    ut_Necromancer  = 32,
    ut_ChaosWarrior  = 33,
    ut_Chosen  = 34,
    ut_Trireme  = 35,
    ut_Galley  = 36,
    ut_Catapult  = 37,
    ut_Warship  = 38,
    ut_BarbSpearmen  = 39,
    ut_BarbSwordsmen  = 40,
    ut_BarbBowmen  = 41,
    ut_BarbCavalry  = 42,
    ut_BarbShaman  = 43,
    ut_BarbSettlers  = 44,
    ut_Berserkers  = 45,
    ut_BeastSpearmen  = 46,
    ut_BeastSwordsmen  = 47,
    ut_BeastHalberdiers  = 48,
    ut_BeastBowmen  = 49,
    ut_BeastPriests  = 50,
    ut_BeastMagicians  = 51,
    ut_BeastEngineers  = 52,
    ut_BeastSettlers  = 53,
    ut_Centaurs  = 54,
    ut_Manticores  = 55,
    ut_Minotaurs  = 56,
    ut_DrowSpearmen  = 57,
    ut_DrowSwordsmen  = 58,

    ut_LizSettlers  = 125,
    ut_DragonTurtle  = 126,
    ut_NmdSpearmen  = 127,
    ut_NmdSwordsmen  = 128,
    ut_NmdBowmen  = 129,
    ut_NmdPriests  = 130,
    ut_NmdMagicians  = 131,
    ut_NmdSettlers  = 132,
    ut_Horsebowmen  = 133,
    ut_NmdPikemen  = 134,
    ut_Rangers  = 135,
    ut_Griffins  = 136,
    ut_OrcSpearmen  = 137,
    ut_OrcSwordsmen  = 138,
    ut_OrcHalberdiers  = 139,
    ut_OrcBowmen  = 140,
    ut_OrcCavalry  = 141,
    ut_OrcShaman  = 142,
    ut_OrcMagicians  = 143,
    ut_OrcEngineers  = 144,
    ut_OrcSettlers  = 145,
    ut_WyvernRiders  = 146,
    ut_TrlSpearmen  = 147,
    ut_TrlSwordsmen  = 148,
    ut_TrlHalberdiers  = 149,
    ut_TrlShaman  = 150,
    ut_TrlSettlers  = 151,
    ut_WarTrolls  = 152,
    ut_WarMammoths  = 153,
    ut_Magic_Spirit  = 154,
    ut_Hell_Hounds  = 155,
    ut_Gargoyles  = 156,
    ut_Fire_Giant  = 157,
    ut_Fire_Elemental  = 158,
    ut_Chaos_Spawn  = 159,
    ut_Chimera  = 160,
    ut_Doom_Bat  = 161,
    ut_Efreet  = 162,
    ut_Hydra  = 163,
    ut_Great_Drake  = 164,
    ut_Skeletons  = 165,
    ut_Ghouls  = 166,
    ut_Night_Stalker  = 167,
    ut_Werewolves  = 168,
    ut_Demon  = 169,
    ut_Wraiths  = 170,
    ut_Shadow_Demons  = 171,
    ut_Death_Knights  = 172,
    ut_Demon_Lord  = 173,
    ut_Zombies  = 174,
    ut_Unicorns  = 175,
    ut_Guardian_Spirit  = 176,
    ut_Angel  = 177,
    ut_Arch_Angel  = 178,
    ut_War_Bears  = 179,
    ut_Sprites  = 180,
    ut_Cockatrices  = 181,
    ut_Basilisk  = 182,
    ut_Giant_Spiders  = 183,
    ut_Stone_Giant  = 184,
    ut_Colossus  = 185,
    ut_Gorgons  = 186,
    ut_Earth_Elemental  = 187,
    ut_Behemoth  = 188,
    ut_Great_Wyrm  = 189,
    ut_Floating_Island  = 190,
    ut_Phantom_Beast  = 191,
    ut_Phantom_Warriors  = 192,
    ut_Storm_Giant  = 193,
    ut_Air_Elemental  = 194,
    ut_Djinn  = 195,
    ut_Sky_Drake  = 196,
    ut_Nagas  = 197,
    UNIT_TYPE_MAX  = 198
};


/*
    (Special) Ranged Attack Types

2-Byte, Signed
"Special"   {100, 101, 102, 103, 104, 105}

*/
enum e_RANGED_ATTACK_TYPE
{
    rat_None         =  -1,
    /* rat_None         =   0, ... BU_IsRangedUnit() checks > 0 */

    rat_Rock         =  10,
    rat_Cannon       =  11,

    rat_Bow          =  20,
    rat_Sling        =  21,
    rat_Unknown      =  22,

    rat_Lightning    =  30,
    rat_Fireball     =  31,
    rat_Sorcery      =  32,
    rat_Deathbolt    =  33,
    rat_Icebolt      =  34,
    rat_Pr_Shaman    =  35,
    rat_Drow         =  36,
    rat_Sprite       =  37,
    rat_Nat_Bolt     =  38,

    srat_Thrown      = 100,
    srat_FireBreath  = 101,
    srat_Lightning   = 102,
    srat_StoneGaze   = 103,
    srat_MultiGaze   = 104,
    srat_DeathGaze   = 105
};

enum e_RANGED_ATTACK_GROUP
{
    rag_Boulder = 1,  /* { 10, ...,  19} / 10 */
    rag_Missile = 2,  /* { 20, ...,  29} / 10 */
    rag_Magic   = 3,  /* { 30, ...,  39} / 10 */
    rag_Short   = 10  /* {100, ..., 109} / 10 */
};

// sizeof:  24h  36d
#pragma pack(push)
#pragma pack(2)
struct s_UNIT_TYPE
{
    /* 00 */  char **  name;                    /* offset (00036AA0) */
    /* 02 */  int8_t   Melee;
    /* 03 */  int8_t   Ranged;
    /* 04 */  int8_t   Ranged_Type;             // enum e_RANGED_ATTACK_TYPE
    /* 05 */  int8_t   Ammo;
    /* 06 */  int8_t   To_Hit;
    /* 07 */  int8_t   Defense;
    /* 08 */  int8_t   Resist;
    /* 09 */  int8_t   Move_Halves;
    /* 0A */  int16_t  Cost;
    /* 0C */  int8_t   Upkeep;
    /* 0D */  int8_t   Race;
    /* 0E */  // int8_t   Bldng1_or_Portrait;      /* enum BLD_TYPE */
    union
    {
        int8_t   reqd_bldg_1;
        int8_t   hero_portrait;  /* entry_num PORTAITS.LBX */
    };
    /* 0F */  // int8_t   Bldng2_or_HeroType;      /* enum BLD_TYPE */
    union
    {
        int8_t   reqd_bldg_2;
        int8_t   hero_type;  /* used by Hero_Slot_Types() to determine the 3 item slots slot type */
    };
    /* 10 */  SAMB_ptr pict_seg;                /* segment pointers to LBX_Alloc_Space headers for reserved EMM file links */
    /* 12 */  int8_t   Hits;
    /* 13 */  int8_t   Sight;
    /* 14 */  int8_t   Transport;
    /* 15 */  int8_t   Figures;
    /* 16 */  int8_t   Construction;
    /* 17 */  int8_t   Spec_Att_Attr;
    /* 18 */  uint16_t Move_Flags;              /* enum MOVEFLAGS */  /* TODO: check the data-type - UnitHasFlying() uses `byte ptr` and `CBW` */
    /* 1A */  int16_t Attribs_1;               /* enum ATTRIB_1 */
    /* 1C */  int8_t Attribs_2;               /* enum ATTRIB_2 */
    /* 1B */  // 2-byte alignment padding
    /* 1E */  uint16_t Abilities;               /* enum ABL_FLAGS */  // macros - UA_...
    /* 20 */  uint16_t Attack_Flags;            /* enum ATK_FLAGS */
    /* 22 */  int16_t  Sound;
};
#pragma pack(pop)



/*

    BEGIN: STU-MoXer :: Generate_Unit_Type_Data()

*/
extern char * _unit_type_names[];
extern struct s_UNIT_TYPE _unit_type_table[];



#endif  /* UNITTYPE_H */
/*
WIZARDS.EXE
Data Segment (DSEG)
    019C
    1D74
    (1D74 - 019C) = 1BD8
    (7540 - 412)  = 7128  (7128 / 36) = 198

24h 36d per element

3E8 - 19C = 24C
1000 - 412 = 588
...16 * 36 = 576 + 12 = 588 ... 

[0] D3 21 05 00 FF 00 00 04 0A 04 64 00 02 04 0A 00 00 00 0A 01 00 01 00 00 41 00 00 00 00 00 00 00 00 00 00 00
[1] D9 21 05 03 64 00 00 03 06 04 64 00 02 00 11 00 01 00 09 01 00 01 00 00 01 00 00 00 00 00 00 00 00 00 00 00
[2] E3 21 01 06 20 00 00 04 06 04 64 00 02 08 1C 03 02 00 05 01 00 01 00 00 01 00 00 00 00 00 00 00 00 00 00 00
[3] E8 21 04 04 14 08 00 04 06 04 64 00 02 08 02 01 03 00 06 01 00 01 00 00 01 00 00 00 00 00 00 00 00 00 00 00
[4] F0 21 05 00 FF 00 00 04 06 04 64 00 02 01 12 00 04 00 07 03 00 01 00 00 21 00 00 00 00 00 00 00 00 00 00 00
